DataProcessors/ТестовоеЗаполнениеЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ТестовоеЗаполнениеЦен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Переоценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Переоценка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ТестовоеЗаполнениеЦен/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МинимальнаяЦена = 10;
	МаксимальнаяЦена = 1000;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипыЦен.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	НЕ ТипыЦен.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыЦен.Код";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ТипЦен = Выборка.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьПереоценкуКоманда(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
	//	Ждать ПредупреждениеАсинх("Необходимо выбрать тип цен");
	//	Возврат;
	//КонецЕсли;
	//
	Если Объект.МинимальнаяЦена <= 0 Или Объект.МаксимальнаяЦена <= 0 Тогда
		Ждать ПредупреждениеАсинх("Цены должны быть больше нуля");
		Возврат;
	КонецЕсли;
	
	Если Объект.МинимальнаяЦена > Объект.МаксимальнаяЦена Тогда
		Ждать ПредупреждениеАсинх("Минимальная цена не может быть больше максимальной");
		Возврат;
	КонецЕсли;
	
	Ссылка = Ждать СоздатьДокументПереоценкиНаСервере(0, Объект.МинимальнаяЦена, Объект.МаксимальнаяЦена);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Ждать ОткрытьЗначениеАсинх(Ссылка);
		Ждать ПредупреждениеАсинх("Документ переоценки создан и проведен");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументПереоценкиНаСервере(ТипЦен, МинимальнаяЦена, МаксимальнаяЦена)
	
	// Запрос для получения всех номенклатур
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Создаем документ Переоценка
	ДокументПереоценка = Документы.Переоценка.СоздатьДокумент();
	ДокументПереоценка.Дата = ТекущаяДата();
	//ДокументПереоценка.ТипЦен = ТипЦен;
	
	// Заполняем табличную часть Товары
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДокументПереоценка.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		
		// Генерируем случайную цену в диапазоне
		Диапазон = МаксимальнаяЦена - МинимальнаяЦена;
		Генератор = Новый ГенераторСлучайныхЧисел();
		СлучайноеЧисло = МинимальнаяЦена + (Диапазон * Генератор.СлучайноеЧисло(МинимальнаяЦена, МаксимальнаяЦена));
		НоваяСтрока.Цена = Окр(СлучайноеЧисло, 2);
		
	КонецЦикла;
	
	// Записываем и проводим документ
	Попытка
		ДокументПереоценка.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ДокументПереоценка.Ссылка;
	Исключение
		Сообщить("Ошибка при проведении документа: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
